
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7785585057)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_firebase_project.ikigaikintore
* Update
  * google_artifact_registry_repository.artifact-repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_firebase_project.ikigaikintore will be created
  + resource "google_firebase_project" "ikigaikintore" {
      + display_name   = (known after apply)
      + id             = (known after apply)
      + project        = "gig-japan-398904"
      + project_number = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":44,"Program":"tfcmt","SHA1":"0c8228c59486b905456bc672310d5f94cf7a9a6f","Vars":{},"WorkflowName":"iaac_plan"} -->